#Знайти добуток елементів масиву цілих чисел, які кратні 7. Розмірність
#масиву - 15. Заповнення масиву здійснити випадковими числами від 10 до 50.
#Драч Ольга Олескандрівна, 122Д

import numpy as np
from random import randint
k = 1
a = 0
for i in range(15):  #Діапазон
    n = randint(10, 50)  #Mасив
print(a)
for i in range(15):
    if n%7 == 0:  #Умова кратності
        a += 1   #Перевіряємо чи є такі числа щоб в кінці не вийшла 1
        k = k * n   #Cтворення
if a == 0:
    print(0)
else:
    print(k)
