#Знайти суму всіх елементів масиву цілих чисел що задовольняють умові:
#остача від ділення на 2 дорівнює 3. Розмірність масиву - 20. Заповнення масиву
#здійснити випадковими числами від 200 до 300.
#Драч Ольга Олескандрівна, 122Д

import numpy as np
from random import randint
с = 0
a = np.zeros(20, dtype=int)
for i in range(20):  #Діапазон
    a = randint(200, 300)  #Масив 
print(a)
for i in range(20):   #Діапазон  
    if a % 2 == 3:   #Умова, але остача від ділення на 2 завжи 1 або 0
        c += a   #Сума
print(a)
