#Знайти добуток елементів масиву, кратних 3 і 9. Розмірність масиву - 10.
#Заповнення масиву здійснити випадковими числами від 5 до 500.
#Драч Ольга Олескандрівна, 122Д

from random import randint
v = 1
for a in range(10):  #Діапазон
    z = randint(5,500)   #Рандом
    if z%3 == 0 and z > 1:   #Умова, яка говорить за діаграмою Ейлера -Вення , що 3 є під множиною 9
        v = v * z   #Елементи беруться по 2 раза(9 кратне і 9 і 3)  
    print(z)
if v == 1:
    print(0)
else:
    print(v)
