# Знайти суму всіх елементів масиву цілих чисел, які менше середнього
# арифметичного елементів масиву. Розмірність масиву - 20. Заповнення масиву
# здійснити випадковими числами від 150 до 300.
#Драч Ольга Олескандрівна, 122Д

from random import randint
c = 0
g = 0
e = list()
for a in range(20):    #Діапазон
    b = randint(150,300)   #Рандом
    c = c + b   #Умова середнього арифметичного
    e.append(b)     #Створюємо масив
d=c/20      #Середнє арифметичне
for f in range(20):     #Проходимо по масиву
    if e[f]<d:     #Порівнюємо
        g=g+e[f]   #Сума
print(g)
