# Напишіть програму аналізу значень температури хворого за добу:
# визначте мінімальне і максимальне значення, середнє арифметичне. Заміри
# температури виробляються шість раз на добу і результати вводяться з клавіатури у
# масив T.
#Драч Ольга Олескандрівна, 122Д

f = 999
v = -272
e = 0
for a in range(6):   #Діапазон
    z = int(input())
    if z < f:
        f = z   #Умова на миниммальну температуру
    if z > v:
        v = z   #Умова на максимальну температуру
    e = z + e    #Сума яка ділиться на 6 (рекурсивно)
print('min:')
print(f)
print('max:')
print(v)
print('avarage:')
print(e/6)
