#Обчислити середнє арифметичне значення тих елементів одновимірного
#масиву, які розташовані за першим по порядку мінімальним елементом.
#Драч Ольга Олескандрівна, 122Д

import numpy as np
k = np.array((45,21,567,89,34,251,7,87,695,854,998))
seredne = 0
min_index = 0
for i in range(len(k)):   #Діапазон
    if k[i] == min(k):    #Шукаємо саме малюсєньке числечко
        min_index = i
for j in range(min_index):   #Діапазон
    seredne += k[j]
print('Середнє арифметичне =',seredne/min_index)
