#Дано два лінійних масиву однакової розмірності. Скласти третій масив з
#добутку елементів перших двох масивів, що стоять на місцях з однаковим індексом.
#Драч Ольга Олескандрівна, 122Д

v=[1,1,2,3,5]   #2 масива
z=[1,1,2,6,24]
f=list()
fx in range(len(v)):   #Діапазон
    f.append(v[x]*z[x])   #Помножемо по індексам
print('Третій масив:',f)
