#Дан лінійний масив цілих чисел. Перевірте, чи є він упорядкованим по
#спаданню.
#Драч Ольга Олескандрівна, 122Д

import numpy
m = numpy.array([3,2,2])   #За зменшинням від - до +
for j in range(len(m)-1):   # Діапазон без останнього так як умова іде на 1 вперед
    if m[j] >= m[j+1]:   #Умова
        m = True
        print('Лінійний масив упорядкований по спаданю')
    else:
      m = False   #Якщо умова не виконується то false
        print('Лінійний масив не упорядкований по спаданю')
        break
print()
