#Дані про температуру повітря і кількості опадів за декаду квітня
#зберігаються в масивах. Визначити кількість опадів, що випали у вигляді дощу і у
#вигляді снігу за цю декаду.
#Драч Ольга Олескандрівна, 122Д


n = 0
e = 0
for i in range(5):  #Діапазон
    f = int(input('Введіть температуру: '))
    h = int(input('Введиіть кількість опадів: '))
    if f < 0:
        n = h + n    #Якщо температура ниже 0 то буде сніг
    else:
        e = h + e   #Якщо вище то дощ
print(e,' дня(ів) йшов дощ')
print(n,' дня(ів) йшов сніг')
