#Змінній t привласнити значення істина, якщо максимальний елемент
#одновимірного масиву єдиний і не перевищує наперед заданого числа а.
#Драч Ольга Олескандрівна, 122Д

r = 12
u = -999   #Максимальний елемент
z = list()
t = False
for b in range(10):    #Діапазон
    x = int(input("Введіть число: "))
    if x > u:     #Знаходимо найбільше число
        u = x
    z.append(x)    #Додаємо всі елементи
f = (z.count(u))    #Кількість максимальних найбільших чисел
if f == 1 and u <= r:   #Якщо маскисальне число гігантів 1 і воно менше заданого, то воно стає тру за умовою
    t = True
    print(t)
