#Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
#повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
#назву першого товару з таблиці.
#Драч Ольга Олескандрівна, 122Д

n = ['Mikasa', 'Speedo', 'Nike', 'Mikasa', 'Newbalance']   #Масив
for i in range(1,5):    #Діапазон
    if n[0]==a[i]:    #Порівнюєм елементи з першим
        print('Повторюється')
        n.remove(n[0])    #Якшо рівно то видалємо 1 елемент
print('Видаленно повторний елемент', n)
