#Наведено список прізвищ брокерів товарної біржі з N чоловік. Поміняйте
#місцями прізвища брокерів: першого і останнього, другого і передостаннього, третього
#з початку і третього від кінця і т.д.
#Драч Ольга Олескандрівна, 122Д

m = ['Андрій','Даша','Настя','Денис','Саша','Олексій','Дмитро']
n = list()    #Новий масив в якому вимірюємо довжину масиву
for l in range(len(m)-1,-1,-1):   #Виходить що ми просто робимо в іншу сторону
    n.append(m[l])    #Додаяємо елементи в новий масив
print(n)
