#Задано дві таблиці. Одна містить найменування послуг, а інша - розцінки
#за ці послуги. Видаліть з обох таблиць все, що передує послузі, ціна якої G гривень.
#Драч Ольга Олескандрівна, 122Д

v = ['Прасування','Прибирання','Нянька','Фотограф']   #1 масив
h = [56,457,320,1243]   #2 масив
G = int(input('Ціна послуги:'))
for j in range(len(b)):  
    try:
        if h[j] == G:
            v.remove(v[j])
            h.remove(h[j])
    except:
        break
print('Таблиці з видаленим елементом')
print(v)
