#В масиві X (1: n) кожен елемент рівний 0, 1 або 5. Переставити елементи
#масиву так, щоб спочатку розташовувалися всі нулі, потім все одиниці, а потім всі
#п'ятірки. Додаткового масиву не заводити.
#Драч Ольга Олескандрівна, 122Д

#за selection
v = [0,1,5,0,1,5,0,1,5]
for r in range(len(v)-1):
    y = r
    for p in range(r+1,len(v)):
        if v[p] < v[y]:#шукаємо мінімальний елемент з остатків і ставимо його на мерше місце
            y = p
    v[r], v[y] = v[y], v[r]
print(v)
