#Введіть масив з 20 елементів і визначте, чи є в ньому елементи з
#однаковими значеннями.
#Драч Ольга Олескандрівна, 122Д

import numpy as np
from random import randint
v = 0
e = np.zeros(20, dtype=int)  #Заміняє нулями
for i in range(20):    #Діапазон, кількість елементів
    e[i] = randint(-10, 10)   #Створюється масив з елементів від -10 до 10 у довільномму порядку
print(e)
for i in range(20):    #2 діапазона, кількість елеметів
    for j in range(20):
        if e[i] == e[j]: #Перевіряє чи збігаються елементи
            v = 1
if v == 0:
    print("Немає однакових елементів.")
else:
    print("Є елементи, які повторюються")
