#У будинку, що складається з 30 квартир, переселити мешканців так, щоб
#мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29
#і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.
#Драч Ольга Олескандрівна, 122Д

from random import randint
x = list()
q = list()
p = 0
for i in range(30):
    b = randint(1,7)#Створюємо рандомний масиив
    x.append(b)
#В іншу сторону додажмо елементи
for j in range(29,-1,-1):
    q.append(x[j])
for k in range(30):
    if q[k] >= 5:#квартири
        p += 1
print('У цих квартирах проживає більше 5 людей:', p)
