#Відомість на зарплату представлена як дві таблиці. Одна містить
#прізвища працівників цеху, а друга - їх зарплату за поточний місяць. Знайдіть прізвище
#працівника, зарплата якого найменш відхиляється від середньої зарплати всіх
#працівників за поточний місяць. Знайдіть прізвища двох працівників з найбільшою
#заробітною платою. Видаліть з відомості на зарплату відомості про працівника,
#зарплата якого мінімальна.
#Драч Ольга Олескандрівна, 122Д

s = ['Міщенко', 'Перевертайло', 'Пастушенко', 'Пучкова', 'Алексеєв', ]
r = [7165, 3347, 2409, 9576, 5608, ]
v = 0
g = 99999999999999999
for d in range(len(r)):
    v = v + r[d]  # сума елементів спочатку
e = v // len(r)  # среднж арифметичне
for f in range(len(r)):  # йдемо по масиву
    h = r[f] - e
    i = e - r[f]
    if r[f] >= e:  #якщо число більше середнього, то від числа віднімаємо середнє
        if h <= g:
            g = h  #а якщо воно менше минулого то воно приймає нове значення
    else:
        if i <= g:  #а якщо число менше середнього то від середнього віднімається число
            g = i
j = g + e
for k in range(len(r)):  # знаходимо це число в масиві
    try:
        if j == r[k]:  # щоб видалити з 2 масивів
            r.remove(r[k])
            s.remove(s[k])
    except:  #використовуєм трай ексепт тому що інакше видає помилку про вихід з діапазону
        break
l = r.copy()  # робимо поверхневу копію
for m in range(len(l) - 1):  # сотруємо за селекшіом
    n = m
    for o in range(m + 1, len(l)):
        if l[o] > l[n]:  # за зменшенням
            n = o
    l[m], l[n] = l[n], l[m]
p = l[:2]  # 2 крайніх елемента
r = l[len(l) - 1:]  # для найменшого
for q in range(len(r)):  # знаходимо найбільші елементи
    if r[q] == p[0] or r[q] == p[1]:
        print(f'{s[q]}  Вища')
for q in range(len(r)):  # видалюємо найменший
    try:
        if r[q] == t[0]:
            r.remove(r[q])  #можно видалити і з двох сторін s.remove(s[q])
    except:
        break
print(s)
print(r)












